Repository: jttuboi/kana_plus_plus
Catalog: lib/l10n/app_*.arb
Languages: es, pt

# studyTitle
source: STUDY
es: ESTUDIO
pt: Estudo

# settingsTitle
source: Settings
es: Ajustes
pt: Configurações

# settingsBasic
source: Basic
es: Básico
pt: Básico

# settingsLanguage
source: Language
es: Idioma
pt: Idioma

# settingsSelectLanguage
source: Select language
es: Seleccione el idioma
pt: Selecione o idioma

# settingsDefaultTrainingSetting
source: Default training setting
es: Configuración de práctica predeterminada
pt: Configuração de treino padrão

# settingsWritingHand
source: Writing hand
es: Mano de escritura
pt: Mão que escreve

# settingsSelectWritingHand
source: Select writing hand
es: Seleccione el mano de escritura
pt: Selecione mão que escreve

# settingsWritingHandLeft
source: Left hand
es: Zurdo
pt: Canhoto

# settingsWritingHandRight
source: Right hand
es: Diestro
pt: Destro

# settingsShowHint
source: Show hint
es: Mostrar pista
pt: Mostra dica

# settingsKanaType
source: Kana type
es: Tipo de kana
pt: Tipo de kana

# settingsSelectKanaType
source: Select kana type
es: Seleccionar tipo de kana
pt: Seleciona o tipo de kana

# settingsOnlyHiragana
source: Only hiragana
es: Solo hiragana
pt: Apenas hiragana

# settingsOnlyKatakana
source: Only katakana
es: Solo katakana
pt: Apenas katakana

# settingsQuantityOfWords
source: Quantity of words
es: Cantidad de palabras
pt: Quantidade de palavras

# settingsOthers
source: Others
es: Otros
pt: Outros

# settingsAbout
source: About
es: Acerca de
pt: Sobre

# settingsPrivacyPolicy
source: Privacy policy (external link)
es: Política de privacidad (Enlace externo)
pt: Política de privacidade (link externo)

# searchLabelInWords
source: Japanese, romaji or translation
es: Japonés, romaji o traducción
pt: japonês, romaji or tradução

# trainingQuitTitle
source: Do you want to finish your training?
es: ¿Quieres terminar tu práctica?
pt: Deseja terminar seu treinamento?

# trainingQuitContent
source: You are going to lost this training data.
es: Vas a perder estos datos de práctica.
pt: Você irá perder os dados desse treino.

# trainingQuitAnswerNo
source: No
pt: Não

# trainingQuitAnswerYes
source: Yes
es: Sí
pt: Sim

# reviewTitle
source: REVIEW
es: REVISÍON
pt: REVISÃO

# preTrainingTitle
source: TRAINING SETTINGS
es: AJUSTES DE PRÁCTICA
pt: CONFIGURAÇÕES de TREINO

# wordsTitle
source: WORDS
es: PALABRAS
pt: PALAVRAS

# wordDetailTranslate
source: Translate
es: Traducción
pt: Tradução

# menuStudy
source: study
es: estudio
pt: estudo

# menuTraining
source: training
es: práctica
pt: treino

# menuWords
source: words
es: palabras
pt: palavras

# menuSettings
source: settings
es: configuración
pt: configurações

# introWriting
source: Here you are going to learn hiragana and katakana writing.
es: Aquí aprenderás a escribir hiragana y katakana.
pt: Aqui você irá aprender a escrita de hiragana e katakana.

# introVocabulary
source: You will also learn a basic vocabulary to help you on your path to Japanese fluency.
es: También aprenderás un vocabulario básico que te ayudará en tu camino hacia la fluidez japonesa.
pt: Também irá aprender um vocabulário básico para ajudar no caminho da fluência em japonês.

# introStudy
source: For this, there are two ways: The area of study which you will show alphabet theory,
es: Para esto, hay dos formas: El área de estudio donde mostrarás la teoría del alfabeto,
pt: Para isso, há duas partes: A área de estudo em que mostrará a teoria do alfabeto,

# introTraining
source: and the training area which you will practice writing the alphabet.
es: y el área de práctica donde entreinarás la escritura del alfabeto.
pt: e a área de treino em que exercitará a escrita do alfabeto.

# introRecommendation
source: If possible, use the stylus pen for better use.
es: Si es posible, use el lápiz óptico para un mejor uso.
pt: Se possível, utilize a caneta stylus para melhor aproveitamento.

# introLetsStarted
source: Let's started
es: Iniciar
pt: Iniciar

# introTitleWriting
source: Welcome
es: Bienvenido
pt: Bem vindo

# introTitleVocabulary
source: Increase your vocabulary
es: Incrementa tu vocabulario
pt: Aumente seu vocabulário

# introTitleStudy
source: Learn the alphabets
es: Aprende los alfabetos
pt: Conheça os alfabetos

# introTitleTraining
source: Practice the strokes
es: Practica los trazos
pt: Exercite os traços

# introTitleRecommendation
source: Use stylus pen
es: Usar lápiz óptico
pt: Utilize caneta stylus

# aboutShare
source: Share
es: Compartir
pt: Compartilhar

# aboutRate
source: Rate
es: Evaluar
pt: Avaliar

# aboutSupport
source: Support
es: Apoyo
pt: Apoio

# aboutSupportMessage
source: Thanks for the support.
es: Gracias por la ayuda.
pt: Obrigado pelo suporte.

# aboutContactTitle
source: Contact:
es: Contacto:
pt: Contato:

# aboutDeveloperTitle
source: Developer:
es: Desarrollador:
pt: Desenvolvedor:

# aboutAppVersionTitle
source: App version:
es: Versión de la aplicación:
pt: Versão do app:

# studyIntroductionTitle
source: Introduction
es: Introducción
pt: Introdução

# studyIntroductionText
source: This app is made for beginners who want to learn the Hiragana and Katakana alphabets. If you already know the alphabet but want to improve, enter on the training menu, which focuses on training how to write these alphabets. But if doesn't know about alphabets, here's content explaining a little about them. Good study.
es: Esta aplicación es ideal para principiantes que desean aprender los alfabetos Hiragana y Katakana. Si ya conoce el alfabeto pero desea mejorar, ingrese al menú de capacitación, que se enfoca en aprender a escribir estos alfabetos. Pero si no sabe sobre alfabetos, aquí hay contenido que explica un poco sobre ellos. Buen estudio.
pt: Este aplicativo é ideal para os iniciantes que querem aprender os alfabetos Hiragana e Katakana. Se você já conhece o alfabeto mas pretende aprimorar, entre no menu de treino, cujo foco é treinar a escrita desses alfabetos. Porém se não conhece sobre os alfabetos, aqui tem conteúdo explicando um pouco sobre eles. Bom estudo.

# studyAlphabetTitle
source: Summary
es: Resumen
pt: Resumo

# studyAlphabetText
source: In the Japanese language there are three kind of alphabets: Hiragana, Katakana and Kanji. We will focus only on Hiragana and Katakana. They are divided into: - Monographs which are the base characters; - Diacritics, which are the extension for the base characters; - Digraphs, which are a union of two syllables; - Geminate consoant, which is the use of a small tsu to indicate how to pronunce the word; - Long vowels that is the use of a dash representing the pronunciation of the long vowel.
es: En el idioma japonés hay tres formas de alfabetos: El Hiragana, el Katakana y el Kanji. Nos centraremos únicamente en el Hiragana y el Katakana. Se dividen en: - Monografías que son la base caracteres; - Diacríticos, que son la extensión de los caracteres base; - Dígrafos, que son una unión de dos sílabas; - Geminados, que es la inclusión de un pequeño tsu para indicar la forma de pronunciación de la palabra ; - Vocales extendidas que es la inclusión de un guión que representa la pronunciación de las vocales extendidas.
pt: No idioma Japonês há três formas de alfabetos: O Hiragana, o Katakana e o Kanji. Focaremos apenas no Hiragana e Katakana. Eles são divididos em: - Monógrafos que são os caracteres base; - Diacríticos, que são a extensão para os caracteres base; - Digráfos, que são união de duas sílabas; - Geminados que é a inclusão de um tsu pequeno para indicar a forma do pronunciamento da palavra; - Vogais prolongadas que é a inclusão de um traço representando a pronúncia da vogal prolongada.

# studyHiraganaText1
source: The Hiragana alphabet is used to write native Japanese words without representation by kanji or grammatical elements such as particles and inflections, and also to represent reading the kanji known as furigana. The base characters ie the vowels and monographs (gojūon in Japanese) are divided into 46 characters: - 5 singular vowels, - 40 consonant-vowel union, -1 singular consonant. The characters will be shown in the tables. Just click on the syllable to show the Kana it represents or click the eye button to show all the Kanas. When looking at the table, they are divided by columns, each one representing the vowels and the lines, which represent the families. For example, the syllables are KA/KI/KU/KE/KO are from the K family.
es: El alfabeto Hiragana se utiliza para escribir palabras japonesas nativas sin representación de kanji o elementos gramaticales como partículas e inflexiones, y también para representar la lectura del kanji conocido como furigana. Los caracteres básicos, es decir, las vocales y monografías (Gojūon en japonés) se dividen en 46 caracteres: - 5 vocales singulares, - 40 unión consonante-vocal, -1 consonante singular. Los caracteres se mostrarán en las tablas. Simplemente haga clic en la sílaba para muestra el Kana que representa o haz clic en el botón del ojo para mostrar todos los Kanas. Al mirar la tabla, se dividen en columnas, cada una representa las vocales y las líneas, que representan las familias. Por ejemplo, las sílabas son KA / KI / KU / KE / KO son de la familia K.
pt: O alfabeto Hiragana é usado para escrever palavras nativas Japonesas sem a representação por kanjis ou elementos gramaticais como partículas e inflexões, e também para representar a leitura do kanji conhecido como furigana. Os caracteres base, ou seja, as vogais e monógrafos (gojūon em Japonês) são divididos em 46 caracteres: - 5 vogais singulares, - 40 união de consoante-vogal, -1 consoante singular. Os caracteres serão mostrados nas tabelas. Para isso, basta clicar na sílaba para mostrar o Kana em que ele representa ou clicar no botão do olho para mostrar todos os Kanas. Ao olhar a tabela, elas são divididos por colunas, em que cada uma representa as vogais e as linhas, cujo representa as famílias. Por exemplo, as sílabas são KA/KI/KU/KE/KO são da família K.

# studyHiraganaText2
source: In addition to the table above, there is an extension which is diacritics (gojūon with dakuten ゛ or handakuten ゜). New phonemes are created by adding these accents. For dakuten, the base characters used are from the K, S, T and H family and for handakuten is the H family only.
es: Además de la tabla anterior, hay una extensión que es diacrítica (gojūon con dakuten ゛ o handakuten ゜). Se crean nuevos fonemas agregando estos acentos. Para dakuten, los caracteres básicos utilizados son de la familia K, S, T y H y para handakuten solo se utiliza la familia H.
pt: Além da tabela acima, há uma extensão que são os diacríticos (gojūon com dakuten ゛ ou handakuten ゜). Novos fonemas são criados ao adicionar esses acentos. Para o dakuten, os caracteres base utilizados são das famílias K, S, T e H e para o handakuten utiliza-se a família H apenas.

# studyHiraganaText3
source: Another kind of syllables is digraphs. They are a union of a base character with ゃ, ゅ or ょ. These base characters are KI, SHI, CHI, NI, HI, MI, RI, GI, JI , DI, BI or PI.
es: Otra forma de sílabas son los dígrafos. Son una unión de un carácter base con ゃ, ゅ o ょ. Estos caracteres básicos son KI, SHI, CHI, NI, HI, MI, RI, GI, JI, DI, BI o PI.
pt: Outra forma de sílabas são os dígrafos. Eles são uma junção de um caracter base com ゃ, ゅ ou ょ. Esses caracteres base são KI, SHI, CHI, NI, HI, MI, RI, GI, JI, DI, BI ou PI.

# studyHiraganaText4
source: For sound representation of a pause before a consonant, っ is used. These consonants can be a character from the K, S, T, B, P family. For example, the word さっか (sakka - author) has a small pause in the reading of the consonant k, but さか (saka - hill) is read without the pause. An exception happens with the family N. When using the syllables of this family, the ん is used instead do っ and the pronunciation is the same as a geminate consonant. For example, the word みんな (minna - all)
es: Para la representación sonora de un silencio antes de una consonante, se utiliza っ. Estas consonantes pueden ser un carácter de la familia K, S, T, B, P. Por ejemplo, la palabra さっか (sakka - autor) tiene una breve pausa en la lectura de la consonante k, pero さか (saka - morro) se lee sin la pausa. Ocurre una excepción con la familia N. Cuando se usan las sílabas de esta familia, se usa la ん en su lugar. っ y la pronunciación es la misma que la de un gemelo. Por ejemplo, la palabra みんな (minna - todos)
pt: Para representação sonora de uma pausa antes de uma consoante, é utilizada o っ. Essas consoantes podem ser um caracter da família K, S, T, B, P. Por exemplo, a palavra さっか (sakka - autor) tem uma breve pausa na leitura da consoante k, porém さか (saka - morro) le-se sem a pausa. Uma exceção acontece com a família N. Ao utilizar as sílabas dessa família, utiliza-se o ん ao invés do っ e a pronúncia é a mesma de um geminado. Por exemplo, a palavra みんな (minna - todos).

# studyKatakanaText1
source: The Katakana alphabet is used to represent foreign words, names of people and foreign places, onomatopoeias and interjections, scientific and technical terms, transcriptions of Sino-Japanese kanji readings, and some corporate marks. The base characters , that is, vowels and monographs (gojūon in Japanese) are divided into 46 characters: - 5 singular vowels, - 40 consonant-vowel union, -1 singular consonant.
es: El alfabeto Katakana se utiliza para representar palabras extranjeras, nombres de personas y lugares extranjeros, onomatopeyas e interjecciones, términos científicos y técnicos, transcripciones de lecturas de kanji chino-japonesas y algunas marcas corporativas. Los caracteres básicos, que es decir, las vocales y monografías (gojūon en japonés) se dividen en 46 caracteres: - 5 vocales singulares, - 40 unión consonante-vocal, - 1 consonante singular.
pt: O alfabeto Katakana é usado para representar as palavras estrangeiras, nomes de pessoas e de locais estrangeiros, onomatopéias e interjeições, termos científicos e técnicos, transcrições das leituras sino-japonesas de kanji e algumas marcas corporativas. Os caracteres base, ou seja, as vogais e monógrafos (gojūon em Japonês) são divididos em 46 caracteres: - 5 vogais singulares, - 40 união de consoante-vogal, -1 consoante singular.

# studyKatakanaText2
source: In addition to the table above, there is an extension which is diacritics (gojūon with dakuten ゛ or handakuten ゜). New phonemes are created by adding these accents. For dakuten, the base characters used are used are base characters. of the K, S, T and H family and for the handakuten the H family is used only.
es: Además de la tabla anterior, hay una extensión que es diacrítica (gojūon con dakuten ゛ o handakuten ゜). Los nuevos fonemas se crean agregando estos acentos. Para dakuten, los caracteres básicos se usan se utilizan son caracteres base. de las familias K, S, T y H y para el handakuten sólo se utiliza la familia H.
pt: Além da tabela acima, há uma extensão que são os diacríticos (gojūon com dakuten ゛ ou handakuten ゜). Novos fonemas são criados ao adicionar esses acentos. Para o dakuten, os caracteres base utilizados são das famílias K, S, T e H e para o handakuten utiliza-se a família H apenas.

# studyKatakanaText3
source: Another kind of syllables is digraphs. They are a union of a base character with ゃ, ゅ or ょ. These base characters are KI, SHI, CHI, NI, HI, MI, RI, GI, JI , DI, BI or PI. In addition to these, in the Katakana alphabet more variations are included because the foreign words contain sounds not included in the Japanese language, thus extending this table to VU, SU, ZU, TE, DE, FU and U.
es: Otra forma de sílabas son los dígrafos. Son una unión de un carácter base con ゃ, ゅ o ょ. Estos caracteres básicos son KI, SHI, CHI, NI, HI, MI, RI, GI, JI, DI, BI o PI. Además de estos, en el alfabeto Katakana se incluyen más variaciones porque las palabras extranjeras contienen sonidos no incluidos en el idioma japonés, extendiendo así esta tabla a VU, SU, ZU, TE, DE, FU y U.
pt: Outra forma de sílabas são os dígrafos. Eles são uma junção de um caracter base com ゃ, ゅ ou ょ. Esses caracteres base são KI, SHI, CHI, NI, HI, MI, RI, GI, JI, DI, BI ou PI. Além desses, no alfabeto Katakana são inclusos mais variações pelo fato de que as palavras estrangeiras contém sons não inclusos no idioma Japonês, assim extendendo essa tabela para VU, SU, ZU, TE, DE, FU e U.

# studyKatakanaText4
source: For sound representation of a rest before a consonant, っ is used. These consonants can be a character from the family K, S, T, B, P.
es: Para la representación sonora de un silencio antes de una consonante, se utiliza っ. Estas consonantes pueden ser un carácter de la familia K, S, T, B, P.
pt: Para representação sonora de uma pausa antes de uma consoante, é utilizada o っ. Essas consoantes podem ser um caracter da família K, S, T, B, P.

# studyKatakanaText5
source: When you use the ー within a word, it means the long vowel. This extension happens both in words written in Hiragana and in Katakana, but this character is only used in words in Katakana, in hiragana it is used ア, イ, ウ, エ and オ.
es: Cuando usas ー dentro de una palabra, significa la extensión de la vocal. Esta extensión ocurre tanto en palabras escritas en Hiragana como en Katakana, pero este carácter solo se usa en palabras en Katakana, en hiragana es utilizado ア, イ, ウ, エ y オ.
pt: Quando utiliza o ー dentro de uma palavra, isto significa o prolongamento da vogal. Esse prolongamento acontece tanto nas palavras escritas em Hiragana quanto em Katakana, porém esse caracter só é utilizado em palavras em Katakana, em hiragana utiliza-se ア, イ, ウ, エ e オ.

# studyKatakanaText6
source: The Katakana alphabet, as it includes more variations due to the fact that foreign words contain sounds not included in the Japanese language, needed variations to supply these sounds through writing. For this, ァ, ィ, ゥ, ェ and ォ creating new digraphs.
es: El alfabeto Katakana, ya que incluye más variaciones debido al hecho de que las palabras extranjeras contienen sonidos no incluidos en el idioma japonés, necesitaba variaciones para suministrar estos sonidos a través de la escritura. Para ello, ァ, ィ, ゥ, ェ y ォ creando nuevos dígrafos.
pt: O alfabeto Katakana, por ter incluir mais variações pelo fato de que as palavras estrangeiras contém sons não inclusos no idioma Japonês, necessitou de variações para suprir esses sons através da escrita. Para isso utiliza-se ァ, ィ, ゥ, ェ e ォ criando novos dígrafos.

# studyMonographsTitle
source: Vowels and monographs
es: Vocales y monografías
pt: Vogais e monógrafos

# studyDiacriticsTitle
source: Diacritics
es: Diacríticos
pt: Diacríticos

# studyDigraphsTitle
source: Digraphs
pt: Dígrafos

# studyGeminatedTitle
source: Geminate consonant
es: Gemelos
pt: Geminados

# studyLongVowelsTitle
source: Long vowels
es: Vocales largas
pt: Vogais prolongadas

# studyExtraSyllabesTitle
source: Small vowels
es: Vocales pequeñas
pt: Vogais pequenas

# errorBack
source: Error: click back button
es: Erro: camarilla no botão voltar
pt: Erro: clique no botão Voltar
